{"grad": [
    {"id": "406.559",
     "name_en": "Topics in Industrial Engineering",
     "name_ko": "산업공학특론",
     "url": "courses/st2015",
     "description_ko": "최근의 데이터마이닝, 텍스트마이닝 및 빅데이터 기법과 이의 산업 응용 사례들에 대하여 공부한다. 이를 토대로 기존 알고리즘을 향상시키거나 신규 알고리즘을 개발하거나 실제 비즈니스 문제를 해결하는 텀 프로젝트를 수행하고, 최종적으로 이를 논문화한다."}
],
"undergrad": [
    {"id": "L0655.000",
     "name_en": "Understanding Big Data",
     "name_ko": "빅데이터의 이해",
     "url": "http://bdai.snu.ac.kr/ko/courses",
     "description_ko": "본 강좌에서는 빅데이터란 무엇이고, 어떻게 분석하며, 어떻게 활용하는지 공부하고, 실제 데이터를 가지고 실습을 통해 체험한다.  확보 가능한 데이터를 찾아 시각화 및 분석을 통해 인사이트를 도출한다.  산업공학, 컴퓨터공학, 통계학 비전공자가 빅데이터를 다양한 분야의 문제 해결에 어떻게 활용할 지에 대한 기초적인 이해를 하게 된다. 어떤 데이터로 어떤 인사이트를 만들 수 있고, 어떤 가치를 만들 수 경험한다. 이를 통해 빅데이터 가치 창출 기획을 할 수 있는 능력을 함양한다. 또한, 빅데이터 전문가나 데이터사이언티스트와 전문적인 수준의 대화를 하고, 스스로 빅데이터 전문가의 길로 갈 수 있을지, 가고 싶은지 알 수 있게 된다. "},
    {"id": "400.320",
     "name_en": "Engineering Research Practice",
     "name_ko": "공학연구의 실습",
     "url": "http://dmlab.snu.ac.kr/courses/2014_engineering-research-practice-1/",
     "description_ko": "본 강좌에서는 대학원 연구실과의 밀접한 연계를 통하여 산업공학의 다양한 연구분야에 대한 소개를 한다. 수강생이 관심을 가지는 연구실에 방문하여 연구에 직접 참여한다."},
     {"id": "406.212",
     "name_en": "Introduction to Computing for Industrial Engineering",
     "name_ko": "산업컴퓨팅개론",
     "url": "http://bdai.snu.ac.kr/ko/courses",
     "description_ko": "본 강좌는 컴퓨터 아키텍쳐, 운영체계, 통신, 인터넷, 알고리즘, 프로그래밍 언어, 소프트웨어 공학, 데이터구조, 데이터베이스, 그래픽스, 인공지능 및 계산이론 등 컴퓨터사이언스의 가장 핵심적인 개념들을 소개한다."},
    {"id": "406.429",
     "name_en": "Data Mining",
     "name_ko": "데이터마이닝",
     "url": "courses/dm2017",
     "description_en": "Students learn the notion of obtaining patterns and knowledge from a large set of data, using the models and techniques from Statistics, Artificial Intelligence, database Engineering. In particular, Market Basket Analysis, Clustering, Regression, Decision Tree, k-NN, Neural Networks are presented. Labs help students to learn how to handle real world data and how to use data mining package XLMiner which runs with Microsoft Excel, as well as SAS Eminer. Term projects involve identifying a problem from business context, formulating a data mining problem, data handling, building and evaluating models.",
     "description_ko": "본 강좌는 대량의 데이터베이스에서 의미있는 패턴을 찾아내는 Data Mining의 배경과 사례, 기법들을 다룬다. 특히 Business Intelligence에 기반한 Data Mining에 포커스를 맞춘다."}]
}
